#!/bin/bash

echo =========================== getoption testing pid:$$ argc:$# =============================

# until [ $# -eq 0 ]
# do
#     echo "第一个参数：$1 参数个数：$#"
#     shift
# done
# 
# echo -------------------------------------------------------------------------------------------

until [ -z "$1" ]
do
    echo "$@"
    shift
done

echo -------------------------------------------------------------------------------------------

count=0
until [ ! $count -lt 10 ]
do
    echo $count
    count=`expr $count + 1`
done

